In [1]:
import numpy as np

In [2]:
import pandas as pd

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],[1,2,3,4])
# pd.DataFrame(data,row,coloumn)

In [21]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[2]
# 1,2,3,4 are series respectively that share a set of common indexes

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: 2, dtype: float64

In [23]:
type(df[2])

pandas.core.series.Series

In [24]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df['new']=[1,2,3,4,5]

In [30]:
df

          1         2         3         4  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [41]:
df['new']=df[1]=df[3]

In [42]:
df

          1         2         3         4       new
A  0.907969  0.628133  0.907969  0.503826  0.907969
B -0.848077 -0.319318 -0.848077  0.605965 -0.848077
C  0.528813  0.740122  0.528813 -0.589001  0.528813
D -0.933237 -0.758872 -0.933237  0.955057 -0.933237
E  2.605967  1.978757  2.605967  0.683509  2.605967

In [43]:
#df.drop('new',axis=1) # not permanent
#for rows axis=0, for coloumns axis=1

In [44]:
df

          1         2         3         4       new
A  0.907969  0.628133  0.907969  0.503826  0.907969
B -0.848077 -0.319318 -0.848077  0.605965 -0.848077
C  0.528813  0.740122  0.528813 -0.589001  0.528813
D -0.933237 -0.758872 -0.933237  0.955057 -0.933237
E  2.605967  1.978757  2.605967  0.683509  2.605967

In [45]:
df.drop('new',axis=1,inplace=True) # permanent

In [46]:
df

          1         2         3         4
A  0.907969  0.628133  0.907969  0.503826
B -0.848077 -0.319318 -0.848077  0.605965
C  0.528813  0.740122  0.528813 -0.589001
D -0.933237 -0.758872 -0.933237  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [50]:
df.shape

(5, 4)

In [53]:
df.loc['C']

1    0.528813
2    0.740122
3    0.528813
4   -0.589001
Name: C, dtype: float64

In [54]:
df.iloc[2]

1    0.528813
2    0.740122
3    0.528813
4   -0.589001
Name: C, dtype: float64

In [55]:
df.loc['B',3]

-0.8480769834036315

In [56]:
df.loc[['A','C'],[1,3]]

          1         3
A  0.907969  0.907969
C  0.528813  0.528813